print("Виконав студент групи КМ-12 Якімов Ярослав\n")
print("Лабораторна робота №1\n")
print("Тема. Програмування лінійних алгоритмів та розгалужених процесів\n")
print("Завдання №1. Обчислення в математичних задачах\n")
print("29) Дано дійсне число R виду nnn. ddd (три цифрових розряду в дробової і цілої")
print("частинах).Поміняти місцями дробову і цілу частини числа і вивести отримане значення числа.\n")

print("Введіть дійсне число:")

R = ""

while not R[0:2].isnumeric() or not R[4:6].isnumeric() or not len(R) == 7 or not R[3] == '.': R = input()

R = float(R)

n = int(R)

d = int((R - int(R))*1000)

print("Відповідь: "+str(d)+"."+str(n))
